class Tasks {
  // Завдання 1
  //Написати програму, що зчитує з клавіатури стрічку і повертає кількість слів
  // (в слові можуть зустрічатися: тільки літери; тільки
  // символи;літери+символи+цифри;літери+символи; літери+цифри; символи(окрім
  // крапки та коми)+цифри;якщо відділені пропусками символи цифри, або цифри
  // та кома чи крапка, то даний ланцюжок є числом)
  task1(String str) {
    int numberCount = 0;
    List<String> allWords = str.split(RegExp('\\s+'));
    for (int i = 0; i < allWords.length; i++) {
      if (RegExp(r'^[0-9.,]+$').hasMatch(allWords[i])){
        numberCount ++;
      }
    }
    return allWords.length - numberCount;
  }

  // Завдання 2
  //Написати програму, що зчитує з клавіатури стрічку і повертає кількість чисел
  task2(String str) {
    return RegExp(r'\b([0-9]+.[0-9])\b').allMatches(str).length;
  }

  // Завдання 3
  //Написати програму, що зчитує з клавіатури стрічку і повертає стрічку в якій
  //прибрані усі символи крім літер
  task3(String str) {
    return str.replaceAll(RegExp('[^a-zA-Z\\s+]+'), '');
  }

  // Завдання 4
  // Написати програму, що зчитує з клавіатури стрічку і повертає стрічку в якій
  // множинні проміжки перетворені в один проміжок
  task4(String str) {
    return str.replaceAll(RegExp('\\s{2,}'), ' ');
  }


  // Завдання 5
  // Написати програму, що зчитує з клавіатури стрічку і повертає
  // стрічку яка містить лише слова, що починаються з великої літери
  task5(String str) {
    return str.replaceAll(RegExp(r'\b([^A-Z\s][a-z0-9\s]+)\b'), '');
  }
}
