class Tasks {
  List<int> task1Result = [];

  // Завдання 1
  // Програма має рахувати числа Фібоначі і виводити
  // результати на екран.
  // Кількість чисел Фібоначі, що необхідно вивести
  // вводить користувач.
  int task1(int n) {
    if (n == 0) {
      return 0;
    } else if (n == 1) {
      return 1;
    }
    return task1(n - 1) + task1(n - 2);
  }

  List<int> saveResultTask1(int n) {
    task1Result = [];
    for (int i = 0; i <= n; i++) {
      task1Result.add(task1(i));
    }
    return task1Result;
  }

  // Завдання 2
  // Програма має рахувати n!
  // Число n вводить користувач.
  task2(int n) => n > 1 ? (n * task2(n - 1)) : 1;

  // Завдання 3
  // Написати программу обчислення кількості
  // (ми не знаємо кількість цифр) десяткових цифр
  // натурального числа. Не використовувати стрічки,
  // суто математичні операції.
  task3(int n) => n > 0 && n < 10 ? 0 : (n ~/ 10) % 10;
}
